---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarInstanceStirrupTieAttachment
source: html/e2b21e0d-7148-0290-d531-c764ca6c1a55.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarInstanceStirrupTieAttachment Property

"Stirrup/Tie Attachment"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarInstanceStirrupTieAttachment { get; }
```